# Создать словарь my_dict = {'name': 'Alice', 'age': 35, 'city': 'New York'}. Добавьте пару
# 'profession': 'Doctor', измените age на 40 и выведите значение city.

my_dict = {'name': 'Alice', 'age': 35, 'city': 'New York'}

my_dict['profession'] = 'Doctor'
my_dict['age'] = 40
print(my_dict['city'])